import numaster


def test_normalize():
    table = [
        ("1", "1"),
        ("一", "1"),
        ("十", "10"),
        ("一〇", "10"),
        ("十一", "11"),
        ("一一", "11"),
        ("二十", "20"),
        ("百", "100"),
        ("百一", "101"),
        ("百十一", "111"),
        ("百二十一", "121"),
        ("百二一", "121"),
        ("2百", "200"),
        ("２百", "200"),
        ("二百", "200"),
        ("一二一", "121"),
        ("千一", "1001"),
        ("千百", "1100"),
        ("二千百一", "2101"),
        ("一百万", "1000000"),
        ("一兆二千万", "1000020000000"),
        ("1,000", "1000"),
        ("1,000,000", "1000000"),
        ("10割", "1"),
        ("１厘", "0.001"),
        ("1%", "0.01"),
    ]
    for source, expect in table:
        assert numaster.normalize(source) == expect, (source, expect)
